package com.commax.controlsub.Common;

/**
 * Created by gbg on 2016-10-04.
 */
public class VersionInfo {

/*******************
* Revision History: IP Home IoT
-----------------------------------------------------------------------------
 [ver]		[Date]			[Description]
-----------------------------------------------------------------------------

 1.0.0      2016.12.28      A64 IP Home IoT 에 2차 개발 버전 release 로 1.0.0 버전으로 release 됨

 1.0.1      2017.01.16      기기연동 가이드 적용, SQE버전 릴리즈

 1.0.2 b    2017.01.18      누수센서 포함 기기 연동 가이드 문구 수정 , 영어 가번역

 1.0.2      2017.01.20      기기닉네임 명 null 일때 다이얼로그 띄우기, SQA 버전 릴리즈

 1.0.3      2017.01.23      기기 닉네임 명 특수기호 및 한글, 영문 허용 가안  SQA 버전 적용 릴리즈 , 허용 특수 문자 확정 지어야 함

 1.0.4      2017.02.24      기기 닉네

 ********************/
}
