package com.commax.control.Common;

/**
 * Created by gbg on 2016-10-04.
 */
public class VersionInfo {

/*******************
* Revision History:
-----------------------------------------------------------------------------
 [ver]		[Date]			[Description]
-----------------------------------------------------------------------------
 0.5.1      2016.10.07      롯데월드타워 - SQA 테스트 용 릴리즈(PXD 50% 버전)
 0.5.2      2016.10.12      롯데월드타워 - 커튼 제어후 완료 타임아웃 10초로 늘림
                                         - Circular Seekbar의 터치 Disable함
                                         - Toast 텍스트 출력 Margin 설정함
 0.6.0      2016.10.24      롯데월드타워 - 제어 타임아웃 10초로 늘림
                                         - 우리집 코치 연동(에너지 바로가기)
 0.6.1      2016.10.26      롯데월드타워 - btn release시 한번만 제어하도록 수정
 0.7.0      2016.10.27      롯데월드타워 - 번역 오류, 글자 깨짐 수정
                                         - Card 그래픽 업데이트 안되는 문제 개선함
 0.8.0      2016.10.31      롯데월드타워 - 번역 오류
                                         - CircularSeekbar 업데이트 오동작 문제 개선함
 0.9.0      2016.11.04      롯데월드타워 - 디바이스 추가시 hangup issue
                                         - 번역 오류
 1.0.0      2016.11.08      롯데월드타워 - 디바이스 Reset시 hangup issue
                            공통 - 캐나다 바이어 정의, 도어락, FAKE 모드 추가함
                            공통 - 즐겨찾기 가이드 메세지 추가, 토스트 배경 수정
 1.0.1      2016.11.18      공통 - 이름변경 시 METER 디바이스 제외시킴
                            캐나다 - 테스트 버전 릴리즈
 1.0.2      2016.12.01      공통 - 번역수정, 동적 탭 메뉴모드 옵션 추가
                            캐나다 - 도어락 CGP 정합(락상태,배터리)
 1.0.3      2016.12.05      공통 - Alert Dialog 긴글자 대비 Layout 수정

 1.0.x      2016.12.06      공통 - PAM bind 시 Service명 명시함-SDK 버전 21(롤리팝) 대응
----------------------------------------------------------------------------------------------------
 IP Home Io T

 1.0.0      2016.12.28      A64 IP Home IoT 에 2차 개발 버전 release 로 1.0.0 버전으로 release 됨

 1.0.1      2017.01.16      A64 가스 락, 가스 감지기 적용 릴리즈

 1.0.1      2017.01.18      가스락 버튼 누를때 열림기능은 제공하지 않는 토스트 메시지 제공

 ********************/
}
